In [1]:
import explore_warnings
import typedef
import report

import pandas as pd
import seaborn as sns

import numpy as np
from IPython.core.display import display, HTML, Markdown

In [2]:
df = pd.DataFrame({'A' : [np.inf, 2, 'city', 4, None, 2, -np.inf, None], 'B' : [0, -np.inf, 0, 2, 1, 0, pd.NA, 4]}, 
                  index=['a1', 'a2','a3','a4','a5','a6','a7','a8'])
df

       A     B
a1   inf     0
a2     2  -inf
a3  city     0
a4     4     2
a5  None     1
a6     2     0
a7  -inf  <NA>
a8  None     4

In [3]:
explore_warnings.pipeline(df)

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [4]:
df.isna().sum()

A    2
B    1
dtype: int64

In [5]:
data = sns.load_dataset('titanic')
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [6]:
explore_warnings.pipeline(data)

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [7]:
data.index

RangeIndex(start=0, stop=891, step=1)

In [8]:
q = data.fare.quantile(0.95)

In [9]:
(data.fare > q).sum()

45

In [10]:
for c in data.columns:
    display(data[c])

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: pclass, Length: 891, dtype: int64

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: sex, Length: 891, dtype: object

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    1
889    0
890    0
Name: sibsp, Length: 891, dtype: int64

0      0
1      0
2      0
3      0
4      0
      ..
886    0
887    0
888    2
889    0
890    0
Name: parch, Length: 891, dtype: int64

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: fare, Length: 891, dtype: float64

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: embarked, Length: 891, dtype: object

0       Third
1       First
2       Third
3       First
4       Third
        ...
886    Second
887     First
888     Third
889     First
890     Third
Name: class, Length: 891, dtype: category
Categories (3, object): ['First', 'Second', 'Third']

0        man
1      woman
2      woman
3      woman
4        man
       ...
886      man
887    woman
888    woman
889      man
890      man
Name: who, Length: 891, dtype: object

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: adult_male, Length: 891, dtype: bool

0      NaN
1        C
2      NaN
3        C
4      NaN
      ...
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: deck, Length: 891, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

0       no
1      yes
2      yes
3      yes
4       no
      ...
886     no
887    yes
888     no
889    yes
890     no
Name: alive, Length: 891, dtype: object

0      False
1      False
2       True
3      False
4       True
       ...
886     True
887     True
888    False
889     True
890     True
Name: alone, Length: 891, dtype: bool

In [11]:
data[data.columns[0]]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [12]:
data.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [13]:
q = data.fare.quantile(0.95)

In [14]:
(data.fare > q).sum()

45

In [15]:
numeric = ['int16', 'int32', 'int64', 'float16', 'float32', 'float64']

In [16]:
data['sex'].dtype in numeric

False

In [17]:
d = data.select_dtypes(include=np.number)
d.columns

Index(['survived', 'pclass', 'age', 'sibsp', 'parch', 'fare'], dtype='object')

In [18]:
a = np.number

In [19]:
a

numpy.number

In [20]:
'float' == a

False

In [21]:
def outlier(data):
    if not typedef.is_data_frame(data):
        return None
    
    print('local')

    numeric = ['int16', 'int32', 'int64', 'float16', 'float32', 'float64']
    res = []
    for col in data.columns:
        if data[col].dtype in numeric:
            q = data[col].quantile(0.95)
            res.append((data[col] > q).sum())
        else:
            res.append(0)
    return pd.Series(res, index=data.columns)

In [22]:
r = outlier(data)
r

local

survived        0
pclass          0
sex             0
age            35
sibsp          30
parch          15
fare           45
embarked        0
class           0
who             0
adult_male      0
deck            0
embark_town     0
alive           0
alone           0
dtype: int64

In [23]:
r = explore_warnings.zero_vals(data)

In [24]:
r

survived       549
pclass           0
sex              0
age              0
sibsp          608
parch          678
fare            15
embarked         0
class            0
who              0
adult_male     354
deck             0
embark_town      0
alive            0
alone          354
dtype: int64